{
  "raw_text": "GMU -     Contact Us call 18001237099   | send info@gmu.ac.in KCET Codes  :  B.Tech - E303   |   MCA - C568   |  MBA - B086 LOGIN About Us Introduction Srishyla Educational Trust G M University GMU- Campus GMU\n                                                    Logo, Flag and Mascot GMU- Anthem Vision, Mission, Values, and\n                                                    Objectives Leadership Chancellor Vice\n                                                                chancellor Pro Vice\n                                                                Chancellor Registrar Chief Financial Officer Statutory\n                                                    Committees Board of Governors Board of Management Academic Council Research and Innovation\n                                                                Council Finance Committee Skill and Vocational\n                                                                Development Council University\n                                                    Documents University Act University Notification University Statutes UGC Letter Organisation Structure University Best\n                                                    Practices Information and Communication\n                                                    Technology (ICT) Learning Management System (LMS) Human Resources (HR) Collaboration and\n                                                    Cooperation Programs UG Programs Faculty of Engineering and\n                                                                Technology (FET) Faculty of Computing and\n                                                                IT (FCIT) Faculty of Basic and\n                                                                Applied Sciences (FBAS) Faculty of Commerce and\n                                                                Management (FCM) GM School of Law (GMSL) PG Programs Faculty of Engineering and\n                                                                Technology (FET) Faculty of Computing and\n                                                                IT (FCIT) Faculty of Basic and\n                                                                Applied Sciences (FBAS) Faculty of Commerce and\n                                                                Management (FCM) GM School of Advanced Studies (GMSAS) GM Business School(GMBS) Admissions Overview Admission Enquiry Programs Offered Admission Criteria Admission Flow Admission Process Program Fee International Admissions Admission Documents Scholorships Admission\n                                                    Counselling Education Loan Refund Policy FAQs Entrance Test Lateral Entry Academics Introduction Academic Schedule UG PG Fees Structure Fee Payment Faculties Faculty of Engineering and\n                                                                Technology (FET) Dean's\n                                                                            Message Faculty\n                                                                            Vision and Mission School of\n                                                                            Computer Science and Technology School\n                                                                            of Engineering Faculty of Computing and IT\n                                                                (FCIT) Dean's\n                                                                            Message Faculty\n                                                                            Vision and Mission School of\n                                                                            Computer Applications (SCA) School of\n                                                                            Computer Science (SCS) Faculty of Basic and Applied\n                                                                Sciences (FBAS) Dean's\n                                                                            Message Faculty\n                                                                            Vision and Mission School of\n                                                                            Mathematical and Physical Sciences School of\n                                                                            Chemical and Biological Sciences School\n                                                                            of Applied Sciences Faculty of Commerce and\n                                                                Management (FCM) Dean's\n                                                                            Message Faculty\n                                                                            Vision and Mission School\n                                                                            of Commerce School of Management Undergraduate Programs GM School of Advanced Studies\n                                                                (GMSAS) Director's \n                                                                            Message Faculty\n                                                                            Vision and Mission Programs GM  Business School(GMBS) Dean's \n                                                                            Message MBA Programs GM School of Law (GMSL) Director's \n                                                                            Message School\n                                                                            Vision and Mission Programs Research Introduction Research Advisor Message Dean's Message Research Co-ordinators PhD Programs offered & PhD\n                                                    Regulations Notifications & Circulars Galary Curriculum Common to all Faculty of Engineering and Technology (FET) School of Computer Science and Technology (SCST) School of Engineering (SE) Faculty of Computing and IT (FCIT) Faculty of Basic and Applied Sciences (FBAS) Faculty of Commerce and Management (FCM) School of Commerce (SC) School of Management (Sm) PhD Admissions PhD Supervisors PhD Research Scholar List Journal Publications Conference Publications Conferences/Symposium Organized Patents Research Bulletin Sponsored/Grant Research Prestigious Lecture Series Centres of Excellence Skill Development LEAP School of Vocational Training School of Vocational Training Technical Diploma Programs Certificate Programs BVoc Degree Programs Short-Term Vocational Skill Courses Community Development Assessment Circulars Fee structure Academic Schedule UG PG Assessment Regulations UG PG Dates of Academic Schedule 2024-25 Dates of Academic Schedule 2025-26 Students Mentoring Proctorial System IQAC Introduction Director's Message IQAC Co-ordinators Quality\n                                                Policy and Benchmarks IQAC-Reports Campus Life Campus Tour Director's Message Campus Life at GMU Student Clubs Technical Clubs AI, Robotics & Machine Learning Club Cybersecurity & Ethical Hacking Club Embedded Systems & Intelligent Mechatronics Club Green Tech and Sustainable Engineering Club Coding, App & Web Development Club Non-Technical Clubs Literary, Debating & Public Speaking Society Cultural and Performing Arts Club Social Impact & Community Outreach Club (Community Connect) Quiz & Knowledge Club (Brainwave Society) Fine Arts &Creative Expression Club Athletics & Sports Students Chapters of Professional Bodies ACM Student Chapter IEEE Student Chapter SAE India Collegiate Club Computer Society of India (CSI) Chapter ASME Student Chapter ISTE Student Chapter Ignitron Mallika SA Co-ordinators Promotions Placements Introduction to CASP Career Advice, Life Skills and\n                                                    Placement Training at GMU Student Placement Details at GMU Placement Statistics Placement Manual IDEA Lab About IDEA Lab GMU IDEA Lab Key Features Facilities Available Organisation Messeage from Chief Executive Officer Director's Message IDEA Lab Co-ordinators Innovation and Design Thinking Week Schedule Startup Policy Agreement Format-Startup GMU-Developed Products Registration Library Introduction Librarian's Message About Library Library Working Hours Library Sections Library Committee Library Staff Library Statistics Library Membership Library Rules and Regulations Library Services & Facilities Library Gallery University Repository Committees UGC-Mandatory Disclosures Public Self Disclosure Proforma Notifications Careers Contact Us Log in Sign up LOGIN Home About Us Introduction Srishyla Educational\n                                                    Trust G M University GMU- Campus GMU Logo, Flag and Mascot GMU- Anthem Vision, Mission, Values, and\n                                                    Objectives Leadership Chancellor Vice\n                                                                chancellor Pro Vice\n                                                                Chancellor Registrar Statutory Committees Board of Governors Board of Management Academic Council Research and Innovation\n                                                                Council Finance Committee Skill and Vocational\n                                                                Development Council University Documents University Act University Notification University Statutes UGC Letter Organisation Structure University Best\n                                                    Practices Information and Communication\n                                                    Technology (ICT) Learning Management System (LMS) Human Resources (HR) Collaboration and\n                                                    Cooperation Programs UG Programs Faculty of Engineering and\n                                                                Technology (FET) Faculty of Computing and\n                                                                IT (FCIT) Faculty of Basic and\n                                                                Applied Sciences (FBAS) Faculty of Commerce and\n                                                                Management (FCM) GM School of Law (GMSL) PG Programs Faculty of Engineering and\n                                                                Technology (FET) Faculty of Computing and\n                                                                IT (FCIT) Faculty of Basic and\n                                                                Applied Sciences (FBAS) Faculty of Commerce and\n                                                                Management (FCM) GM School of Advanced Studies (GMSAS) GM Business School(GMBS) Admissions Overview Admission Enquiry Programs Offered Admission Criteria Admission Flow Admission Process Program Fee International Admissions Admission Documents Scholorships Admission\n                                                    Counselling Education Loan Refund Policy FAQs Entrance Test Lateral Entry Academics Introduction Academic Schedule UG PG Fees Structure Fee Payment Campus life Campus Tour Directors\n                                                    Message Campus Life at GMU Calendar of Events Facility and Contact\n                                                    Details Promotions Student\n                                        Placements Introduction to CASP Career Advice, Life Skills and\n                                                    Placement Training at GMU Student Placement Details at GMU Placement Statistics Placement Manual Contact Us Careers Log in Sign up Contact Us 📞 9364099720 ✉️ admissions@gmu.ac.in 📞 6364259993 Submit Lead Form 📞 +91 8192-233345 📞 +91 8192-233377 📞 +91 8192-233399 📞 +91 8192-233344 📞 +91 8192-233345 Or complete our quick enquiry form we will get back to you! S. No. Department Name Mobile e-mail 1 University Ms. Nischita M Gokavi Ms. H Priya 9364898247 dir.hr@gmu.ac.in ps.vc@gmu.ac.in 2 Admission Manager and Academic Registration Officer Nandini B A 9364099720 nandini.aro@gmu.ac.in 3 Dean- Marketing and promotion Dr. Veeragangadhara Swamy 9449950591 dean.mp@gmu.ac.in 4 Registrar Dr. Sunil Kumar B S 6364259993 registrar@gmu.ac.in 5 Director, Student Affairs Dr. Kiran Kumar 9663368484 director.sa@gmu.ac.in 6 Director, Career Advice and Students Placements Dr. Sanjay Kumar 9848456868 Director.casp@gmu.ac.in 7 Hostels Dr. Girish Bolakatti 9901499119 chiefwarden@gmu.ac.in 8 Director – School of Vocational Training Dr. Sreedhar B R 9448394632 director.svt@gmu.ac.in 9 Director- School of Digital Technical Competency Development Prof. Keerthi Prasad Dr. Shivaprakash Palleda 9620945991 8073061654 director.sdtcd@gmu.ac.in assocdirector.sdtcd@gmu.ac.in 10 Director- GM Techno Solutions Dr. Srinivasa C V 9448588792 director.ctcp@gmu.ac.in 11 Dean Research Dr. Bharath K. N. 9844400397 dean.research@gmu.ac.in Admissions open for academic year 2025-26 Admissions open for academic year 2025-26 Admissions open for academic year 2025-26 Press & Media More-News GM University P.B. Road , Davanagere Davangere - 577006 Karnataka info@gmu.ac.in 6364259993 Notice Board Assessment and Evaluation Circular-PhD Orientation Programme-2023-24 Circular for RPRC-2024 University Calendar of Events Proctor’s Handbook Students Affairs Handbook Digital Technical Competency Development Handbook Career Advice and Placements Handbook Innovation and Incubation Handbook Library Handbook Professor of Practice Professor of Eminence Institutional Documents GMU Academic Processes Hand Book GMU Knowledge Series GM University Brochure GM University Annual Reports University Presentation A Quarterly Campus Magazine Research Bulletin Research Support University Policies UGC Statutary Commitees University Convocation Proceedings Copyright © 2024 GM UNIVERSITY All Rights Reserved I'm a beta version ©️ All rights reserved - GEM VENTURES LLP",
  "source_url": "https://gmu.ac.in/contact"
}